Конфигурация/src/Documents/ВедомостьОценок/ВедомостьОценок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВедомостьОценок</name>
  <registerRecords>AccumulationRegister.УспеваемостьСтудентов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>УчебныйПериод</name>
    <type>
      <types>CatalogRef.УчебныеПериоды</types>
    </type>
  </attributes>
  <attributes>
    <name>УчебнаяГруппа</name>
    <type>
      <types>CatalogRef.УчебныеГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>Дисциплина</name>
    <type>
      <types>CatalogRef.Дисциплины</types>
    </type>
  </attributes>
  <attributes>
    <name>Преподаватель</name>
    <type>
      <types>CatalogRef.Преподаватели</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОценки</name>
    <type>
      <types>EnumRef.ВидыОценок</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОценивания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Оценки</name>
    <attributes>
      <name>Студент</name>
      <type>
        <types>CatalogRef.Студенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Балл</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОценкаТекстом</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Конфигурация/src/AccumulationRegisters/УспеваемостьСтудентов/УспеваемостьСтудентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>УспеваемостьСтудентов</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Балл</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>УчебныйПериод</name>
    <type>
      <types>CatalogRef.УчебныеПериоды</types>
    </type>
  </attributes>
  <attributes>
    <name>Преподаватель</name>
    <type>
      <types>CatalogRef.Преподаватели</types>
    </type>
  </attributes>
  <attributes>
    <name>ОценкаТекстом</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Студент</name>
    <type>
      <types>CatalogRef.Студенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УчебнаяГруппа</name>
    <type>
      <types>CatalogRef.УчебныеГруппы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Дисциплина</name>
    <type>
      <types>CatalogRef.Дисциплины</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидОценки</name>
    <type>
      <types>EnumRef.ВидыОценок</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Конфигурация/src/Documents/ВедомостьОценок/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	ПериодДвижения = ?(ЗначениеЗаполнено(ДатаОценивания), ДатаОценивания, Дата);

	Движения.УспеваемостьСтудентов.Записывать = Истина;

	Для Каждого СтрокаОценки Из Оценки Цикл

		Если НЕ ЗначениеЗаполнено(СтрокаОценки.Студент) Тогда
			Продолжить;
		КонецЕсли;

		Если СтрокаОценки.Балл < 0 Тогда
			Продолжить;
		КонецЕсли;

		Движение = Движения.УспеваемостьСтудентов.Добавить();
		Движение.Период = ПериодДвижения;
		Движение.Студент = СтрокаОценки.Студент;
		Движение.УчебнаяГруппа = УчебнаяГруппа;
		Движение.Дисциплина = Дисциплина;
		Движение.ВидОценки = ВидОценки;
		Движение.Балл = СтрокаОценки.Балл;
		Движение.УчебныйПериод = УчебныйПериод;
		Движение.Преподаватель = Преподаватель;
		Движение.ОценкаТекстом = СтрокаОценки.ОценкаТекстом;

	КонецЦикла;

КонецПроцедуры
